In [2]:
import pandas as pd
import numpy as np

In [26]:
data1 = {
    "Name": ["Subarna Poudel", "Ritesh Shrestha", "Bishal Sharma"],
    "Age": [18, 17, 19],
    "Address": ["Chitwan","Kathmanndu","Kathmandu"],
}

d1= pd.DataFrame(data1)
d1

              Name  Age     Address
0   Subarna Poudel   18     Chitwan
1  Ritesh Shrestha   17  Kathmanndu
2    Bishal Sharma   19   Kathmandu

In [44]:
data2 = [
    {"Name": "Subarna", "Age": 18},
    {"Name": "Ritesh", "Age": 17}, 
    {"Name": "Bishal"}, 
]
d2=pd.DataFrame(data2,index=[1,2,3])
d2

      Name   Age
1  Subarna  18.0
2   Ritesh  17.0
3   Bishal   NaN

In [33]:
# Exporting to csv file
d1.to_csv('d1.csv')

In [45]:
# Exporting to excel file
d2.to_excel('d2.xlsx')

In [3]:
# Reading from data file
covid_df=pd.read_csv('nepal_covid.csv')
covid_df

           date  new_cases  new_deaths  new_tests
0    2019-12-31        0.0         0.0        NaN
1    2020-01-01        0.0         0.0        NaN
2    2020-01-02        0.0         0.0        NaN
3    2020-01-03        0.0         0.0        NaN
4    2020-01-04        0.0         0.0        NaN
..          ...        ...         ...        ...
243  2020-08-30     1444.0         1.0    53541.0
244  2020-08-31     1365.0         4.0    42583.0
245  2020-09-01      996.0         6.0    54395.0
246  2020-09-02      975.0         8.0        NaN
247  2020-09-03     1326.0         6.0        NaN

[248 rows x 4 columns]

In [54]:
type(covid_df)

pandas.core.frame.DataFrame

In [55]:
covid_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 248 entries, 0 to 247
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        248 non-null    object
 1   new_cases   248 non-null    float64
 2   new_deaths  248 non-null    float64
 3   new_tests   135 non-null    float64
dtypes: float64(3), object(1)
memory usage: 6.8+ KB

In [57]:
covid_df.describe()

         new_cases  new_deaths     new_tests
count   248.000000  248.000000    135.000000
mean   1094.818548  143.133065  31699.674074
std    1554.508002  227.105538  11622.209757
min    -148.000000  -31.000000   7841.000000
25%     123.000000    3.000000  25259.000000
50%     342.000000   17.000000  29545.000000
75%    1371.750000  175.250000  37711.000000
max    6557.000000  971.000000  95273.000000

In [58]:
covid_df.shape

(248, 4)

In [59]:
covid_df.columns

Index(['date', 'new_cases', 'new_deaths', 'new_tests'], dtype='object')

In [60]:
covid_df.head()

         date  new_cases  new_deaths  new_tests
0  2019-12-31        0.0         0.0        NaN
1  2020-01-01        0.0         0.0        NaN
2  2020-01-02        0.0         0.0        NaN
3  2020-01-03        0.0         0.0        NaN
4  2020-01-04        0.0         0.0        NaN

In [61]:
covid_df.head(10)

         date  new_cases  new_deaths  new_tests
0  2019-12-31        0.0         0.0        NaN
1  2020-01-01        0.0         0.0        NaN
2  2020-01-02        0.0         0.0        NaN
3  2020-01-03        0.0         0.0        NaN
4  2020-01-04        0.0         0.0        NaN
5  2020-01-05        0.0         0.0        NaN
6  2020-01-06        0.0         0.0        NaN
7  2020-01-07        0.0         0.0        NaN
8  2020-01-08        0.0         0.0        NaN
9  2020-01-09        0.0         0.0        NaN

In [62]:
covid_df.tail()

           date  new_cases  new_deaths  new_tests
243  2020-08-30     1444.0         1.0    53541.0
244  2020-08-31     1365.0         4.0    42583.0
245  2020-09-01      996.0         6.0    54395.0
246  2020-09-02      975.0         8.0        NaN
247  2020-09-03     1326.0         6.0        NaN

In [64]:
covid_df['new_tests']

0          NaN
1          NaN
2          NaN
3          NaN
4          NaN
        ...
243    53541.0
244    42583.0
245    54395.0
246        NaN
247        NaN
Name: new_tests, Length: 248, dtype: float64

In [68]:
print(type(covid_df))
print(type(covid_df['new_tests']))
#DataFrame is 3d whereas series is 2d.

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [71]:
print(covid_df['new_tests'][200])
print(covid_df.at[200,'new_tests'])

27569.0
27569.0

In [76]:
covid_df.loc[200]

date          2020-07-18
new_cases          231.0
new_deaths          11.0
new_tests        27569.0
Name: 200, dtype: object

In [78]:
covid_df.loc[200, "new_tests"]

27569.0

In [83]:
covid_df.loc[200:205, "new_tests"]

200    27569.0
201    20621.0
202    14121.0
203    23915.0
204    29288.0
205    33018.0
Name: new_tests, dtype: float64

In [82]:
covid_df.iloc[np.arange(200,205),3]

200    27569.0
201    20621.0
202    14121.0
203    23915.0
204    29288.0
Name: new_tests, dtype: float64

We have to specifiy row/column name in loc but not in iloc. In iloc row/column index is used.

In [86]:
# Samples gives random datas.
covid_df.sample(5)

           date  new_cases  new_deaths  new_tests
161  2020-06-09      280.0        65.0    32200.0
143  2020-05-22      642.0       156.0    42987.0
136  2020-05-15      992.0       262.0    39027.0
53   2020-02-22       14.0         0.0        NaN
142  2020-05-21      665.0       161.0    40644.0

In [97]:
cases_df = covid_df[['date','new_cases']]
# cases_df is only a view of covid_df. So whenever data is changed in cases_df, it is also changed in covid_df.
cases_df

           date  new_cases
0    2019-12-31        0.0
1    2020-01-01        0.0
2    2020-01-02        0.0
3    2020-01-03        0.0
4    2020-01-04        0.0
..          ...        ...
243  2020-08-30     1444.0
244  2020-08-31     1365.0
245  2020-09-01      996.0
246  2020-09-02      975.0
247  2020-09-03     1326.0

[248 rows x 2 columns]

In [98]:
deaths_df = covid_df[['date','new_deaths']].copy()
# Here deaths_df is the copy. So whenever data is changed in deaths_df, it won't change in covid_df.
deaths_df

           date  new_deaths
0    2019-12-31         0.0
1    2020-01-01         0.0
2    2020-01-02         0.0
3    2020-01-03         0.0
4    2020-01-04         0.0
..          ...         ...
243  2020-08-30         1.0
244  2020-08-31         4.0
245  2020-09-01         6.0
246  2020-09-02         8.0
247  2020-09-03         6.0

[248 rows x 2 columns]

In [100]:
total_cases= covid_df.new_cases.sum()
total_cases

271515.0

In [101]:
total_deaths=covid_df.new_deaths.sum()
total_deaths

35497.0

In [104]:
death_rate = total_deaths / total_cases
death_rate

0.13073679170579894

In [49]:
covid_df[['new_cases','new_deaths','new_deaths']].sum()

new_cases     271663.0
new_deaths     35497.0
new_deaths     35497.0
dtype: float64

In [108]:
# When we want to look at the days which had more than 1000 reported cases
high_cases = covid_df.new_cases > 1000
high_cases

0      False
1      False
2      False
3      False
4      False
       ...
243     True
244     True
245    False
246    False
247     True
Name: new_cases, Length: 248, dtype: bool

In [126]:
# Filter the report of high cases day
covid_df[high_cases]

           date  new_cases  new_deaths  new_tests  death_rate
68   2020-03-08     1247.0        36.0        NaN    0.028869
69   2020-03-09     1492.0       133.0        NaN    0.089142
70   2020-03-10     1797.0        98.0        NaN    0.054535
72   2020-03-12     2313.0       196.0        NaN    0.084738
73   2020-03-13     2651.0       189.0        NaN    0.071294
..          ...        ...         ...        ...         ...
241  2020-08-28     1409.0         5.0    65135.0    0.003549
242  2020-08-29     1460.0         9.0    64294.0    0.006164
243  2020-08-30     1444.0         1.0    53541.0    0.000693
244  2020-08-31     1365.0         4.0    42583.0    0.002930
247  2020-09-03     1326.0         6.0        NaN    0.004525

[72 rows x 5 columns]

In [135]:
# Adding a new column (death rate)
covid_df['death_rate']= covid_df.new_deaths / covid_df.new_cases
covid_df.tail()

           date  new_cases  new_deaths  new_tests  death_rate
243  2020-08-30     1444.0         1.0    53541.0    0.000693
244  2020-08-31     1365.0         4.0    42583.0    0.002930
245  2020-09-01      996.0         6.0    54395.0    0.006024
246  2020-09-02      975.0         8.0        NaN    0.008205
247  2020-09-03     1326.0         6.0        NaN    0.004525

In [137]:
# Removing the death_rate column
covid_df.drop('death_rate', axis=1)

           date  new_cases  new_deaths  new_tests
0    2019-12-31        0.0         0.0        NaN
1    2020-01-01        0.0         0.0        NaN
2    2020-01-02        0.0         0.0        NaN
3    2020-01-03        0.0         0.0        NaN
4    2020-01-04        0.0         0.0        NaN
..          ...        ...         ...        ...
243  2020-08-30     1444.0         1.0    53541.0
244  2020-08-31     1365.0         4.0    42583.0
245  2020-09-01      996.0         6.0    54395.0
246  2020-09-02      975.0         8.0        NaN
247  2020-09-03     1326.0         6.0        NaN

[248 rows x 4 columns]

In [136]:
# In above example, we removed death_rate column but it didn't affect the main table as we can see below:
covid_df.head()

         date  new_cases  new_deaths  new_tests  death_rate
0  2019-12-31        0.0         0.0        NaN         NaN
1  2020-01-01        0.0         0.0        NaN         NaN
2  2020-01-02        0.0         0.0        NaN         NaN
3  2020-01-03        0.0         0.0        NaN         NaN
4  2020-01-04        0.0         0.0        NaN         NaN

In [138]:
# To remove it permanently, we use inplace= True
covid_df.drop('death_rate', axis=1, inplace =True)
# Or
# covid_df.drop(columns=['death_rate'], inplace =True)
covid_df.head()

         date  new_cases  new_deaths  new_tests
0  2019-12-31        0.0         0.0        NaN
1  2020-01-01        0.0         0.0        NaN
2  2020-01-02        0.0         0.0        NaN
3  2020-01-03        0.0         0.0        NaN
4  2020-01-04        0.0         0.0        NaN

In [10]:
# Sorting
covid_df.sort_values('new_cases', ascending=False)

           date  new_cases  new_deaths  new_tests
82   2020-03-22     6557.0       795.0        NaN
87   2020-03-27     6153.0       660.0        NaN
81   2020-03-21     5986.0       625.0        NaN
89   2020-03-29     5974.0       887.0        NaN
88   2020-03-28     5959.0       971.0        NaN
..          ...        ...         ...        ...
28   2020-01-28        0.0         0.0        NaN
30   2020-01-30        0.0         0.0        NaN
32   2020-02-01        0.0         0.0        NaN
33   2020-02-02        0.0         0.0        NaN
172  2020-06-20     -148.0        47.0    29875.0

[248 rows x 4 columns]

In [15]:
covid_df.loc[172,'new_cases']

-148.0

In [23]:
# Writing in a cell
covid_df.at[172,'new_cases']= 0

In [24]:
covid_df.loc[172,'new_cases']

0.0